package cycle;

import java.util.Scanner;

public class ReverseString {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        System.out.print("Введите строку: ");
        String input = scanner.nextLine();

        String reversed = reverse(input);
        System.out.println("Обратная строка: " + reversed);
    }

    static String reverse(String str) {
        //TODO: Палиндром (обратная строка)
        // Напишите программу, которая принимает строку и выводит ее
        // в обратном порядке с использованием цикла.

        return "";
    }
}
